//ใช้ for loop
#include <stdio.h>                           //เรียกใช้ library มาตรฐาน

int main(){                                  //ฟังก์ชันหลักของโปรแกรม
     for(int i = 2; i <= 10; i += 2){        //ใช้ for loop ในการวนลูป จาก 2 ถึง 10 โดยเพิ่มค่า i ทีละ 2
        printf(" %d", i);                    //แสดงค่าปัจจุบันของ i
     }
        printf("\n\n End of loop\n");         //แสดงข้อความ End for loop
        return 0;                            //คืนค่าศูนย์เพื่อบอกว่าการทำงานเสร็จสมบูรณ์
}

// อธิบายการทำงานของโปรแกรม:
//1. ประกาศตัวแปร i เท่ากับ 2
//2. ใช้ for loop โดยมีเงื่อนไขว่า i ต้องน้อยกว่าหรือเท่ากับ 10 และเพิ่มค่า i ทีละ 2 ในแต่ละลูป
//3. แต่ละลูปจะแสดงค่าปัจจุบันของ i ก่อนแล้วค่อยให้ i เพิ่มที่ละ 2
//4. เมื่อค่าของ i เกิน 10 จะแสดงข้อความ End of loop 