//ใช้ whitle loop
#include <stdio.h>                  // เรียกใช้ library มาตรฐาน

int main(){                         // ฟังก์ชันหลักของโปรแกรม
    int i = 2;                      // ประกาศตัวแปร i = 2

    while (i <= 10){                // ใช้ while loop ในการวนลูปจาก 2 ถึง 10
        printf(" %d", i);           // แสดงค่าปัจจุบันในลูป
        i += 2;                     // เพิ่มค่า i ทีละ 2
    }
    printf("\n\n End of loop\n");     // แสดงข้อความ End of loop

    return 0;                       // คืนค่าศูนย์เพื่อบอกว่าการทำงานเสร็จสมบูรณ์
}

// อธิบายการทำงานของโปรแกรม:
//1. ประกาศตัวแปร i เท่ากับ 2
//2. ใช้ while loop ในการวนลูปโดยมีเงื่อนไขว่า i ต้องน้อยกว่าหรือเท่ากับ 10
//3. แต่ละลูปจะแสดงค่าปัจจุบันของ i และเพิ่มค่า i ทีละ 2
//4. เมื่อ i เกิน 10 จะออกจากลูปและแสดงข้อความ End of loop